package rbsoftskkm.dto.enums;

/**
 * Шрифт текстовой строки документа:
 * Normal - Обычный
 * Bold - Жирный
 * Small - Мелкий
 * Medium - Средний
 * Big - Крупный
 * H1 - Заголовок 1
 * H2 - Заголовок 2
 * H3 - Заголовок 3
 * H4 - Заголовок 4
 * H5 - Заголовок 5
 */
public enum PrintFont {

    /** Обычный */
    Normal,

    /** Жирный */
    Bold,

    /** Мелкий */
    Small,

    /** Средний */
    Medium,

    /** Крупный */
    Big,

    /** Заголовок 1 */
    H1,

    /** Заголовок 2 */
    H2,

    /** Заголовок 3 */
    H3,

    /** Заголовок 4 */
    H4,

    /** Заголовок 5 */
    H5
}
