package rbsoftskkm.dto.enums;

import com.fasterxml.jackson.annotation.JsonValue;

/**
 * Система налогообложения:
 * ОСН - Общий
 * УСН - Упрощенная Доход
 * УСНД_Р - Упрощенная Доход минус Расход
 * ЕНВД - Единый налог на вмененный доход
 * ЕСН - Единый сельскохозяйственный налог
 * ПСН - Патентная система налогообложения
 */
public enum TaxSystem {

    /** Общий */
    ОСН(0),

    /** Упрощенная Доход */
    УСН(1),

    /** Упрощенная Доход минус Расход */
    УСНД_Р(2),

    /** Единый налог на вмененный доход */
    ЕНВД(3),

    /** Единый сельскохозяйственный налог */
    ЕСН(4),

    /** Патентная система налогообложения */
    ПСН(5);

    /** Числовое значение реквизита, как в API сервера ККМ. */
    @JsonValue
    public final int value;

    TaxSystem(int value) {
        this.value = value;
    }
}
